# 11.	迴圈敘述的練習-interest
# 錢精打以10%單利投資100000元，郝細算則以5%複利投資100000元。
# 計算多少年後郝細算的投資可以超過錢精打，並將此時兩人錢數印出。(27年後)
# 提示：單利公式：P(1+r*n)    複利公式：P(1+r)^n
# P：本金，r：利率，n：多少年
print('錢精打以10%單利投資100000元，郝細算則以5%複利投資100000元。')
print('計算多少年後郝細算的投資可以超過錢精打，並將此時兩人錢數印出。')
print('提示：單利公式：P(1+r*n)    複利公式：P(1+r)^n')
print('P：本金，r：利率，n：多少年')
P1 = 100000
r1 = 10
P2 = 100000
r2 = 5
n = 0
while True:
    n += 1
    if P2*((1 + (r2 / 100)) ** n) > P1*(1 + (r1 / 100) * n):
        break
print('({}年後)'.format(n))
print('錢精打的資產:{:.0f}(NTD)'.format(P1*(1 + (r1 / 100) * n)))
print('郝細算的資產:{:.0f}(NTD)'.format(P2*((1 + (r2 / 100)) ** n)))
